app/controllers/carts_controller.rb

  def show
    @items_in_cart = JoinTableItemsCart.where(cart_id:current_user.cart.id)
---
SELECT "join_table_items_carts".* FROM "join_table_items_carts" WHERE "join_table_items_carts"."cart_id" = $1  [["cart_id", 1]]