app/controllers/join_table_items_carts_controller.rb

  def destroy
    @item_delete = JoinTableItemsCart.find(params[:id])
    @item_delete.destroy
---
SELECT  "join_table_items_carts".* FROM "join_table_items_carts" WHERE "join_table_items_carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "join_table_items_carts" WHERE "join_table_items_carts"."id" = $1  [["id", 1]]