app/controllers/orders_controller.rb

  def show
    puts "*"*50
    puts params
    puts "*"*50
    @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]

  def create
    @cart = current_user.cart
    puts "*"*50
    puts params
    puts "*"*50

    order = Order.create(
      'user_id' => current_user.id
    )
    @order = Order.where(user_id: current_user.id)
---
INSERT INTO "orders" ("created_at", "updated_at", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2022-06-09 17:48:08.357398"], ["updated_at", "2022-06-09 17:48:08.357398"], ["user_id", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 3], ["LIMIT", 1]]