app/models/join_table_items_cart.rb

  def self.add_or_create_cart_item_link(permit_link_params)
  	if JoinTableItemsCart.find_by(cart_id: permit_link_params[:cart_id], item_id: permit_link_params[:item_id]) == nil
  		@new_item_add = JoinTableItemsCart.create(item_id: permit_link_params[:item_id], cart_id: permit_link_params[:cart_id], quantity: 1)
  	else
  		@new_item_add = JoinTableItemsCart.find_by(cart_id: permit_link_params[:cart_id], item_id: permit_link_params[:item_id])
  		@new_item_add.update(quantity: @new_item_add.quantity + 1)
---
SELECT  "join_table_items_carts".* FROM "join_table_items_carts" WHERE "join_table_items_carts"."cart_id" = $1 AND "join_table_items_carts"."item_id" = $2 LIMIT $3  [["cart_id", 1], ["item_id", 1], ["LIMIT", 1]]
INSERT INTO "join_table_items_carts" ("item_id", "cart_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["item_id", 1], ["cart_id", 1], ["quantity", 1], ["created_at", "2022-06-08 12:29:53.047648"], ["updated_at", "2022-06-08 12:29:53.047648"]]
UPDATE "join_table_items_carts" SET "quantity" = $1, "updated_at" = $2 WHERE "join_table_items_carts"."id" = $3  [["quantity", 2], ["updated_at", "2022-06-08 12:30:38.455064"], ["id", 3]]